/**
 * 首页 首席投顾观点 数据 
*/
exports.response = function (req, res) {
  return {
    "code": "0",
    "msg": "OK",
    "resultData": [
      {'descri': '关注业绩优秀、股价超跌股价超跌', 'id': 0},
      {'descri': '控制仓位、耐心等待市场企业市场企业', 'id': 1},
      {'descri': '关注业绩优秀、股价超跌股价超跌', 'id': 2},
      {'descri': '控制仓位、耐心等待市场企业市场企业', 'id': 3},
      {'descri': '关注业绩优秀、股价超跌股价超跌', 'id': 4},
      {'descri': '控制仓位、耐心等待市场企业市场企业', 'id': 5},
      {'descri': '关注业绩优秀、股价超跌股价超跌', 'id': 6},
      {'descri': '控制仓位、耐心等待市场企业市场企业', 'id': 7},
      {'descri': '关注业绩优秀、股价超跌股价超跌', 'id': 8},
      {'descri': '控制仓位、耐心等待市场企业市场企业', 'id': 9},
      {'descri': '关注业绩优秀、股价超跌股价超跌', 'id': 10},
      {'descri': '控制仓位、耐心等待市场企业市场企业', 'id': 11},
      {'descri': '关注业绩优秀、股价超跌股价超跌', 'id': 12},
      {'descri': '控制仓位、耐心等待市场企业市场企业', 'id': 13},
      {'descri': '关注业绩优秀、股价超跌股价超跌', 'id': 14},
      {'descri': '控制仓位、耐心等待市场企业市场企业', 'id': 15},
    ],
  }
}